In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('SBIN.NS.csv')

In [3]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,1996-01-01,18.691147,18.978922,18.540184,18.823240,12.651093,43733533.0
1,1996-01-02,18.894005,18.964767,17.738192,18.224106,12.248409,56167280.0
2,1996-01-03,18.327892,18.568489,17.643839,17.738192,11.921828,68296318.0
3,1996-01-04,17.502312,17.832542,17.223972,17.676863,11.880607,86073880.0
4,1996-01-05,17.738192,17.785366,17.459852,17.577793,11.814024,76613039.0

In [4]:
df.iloc[:, 4:5]

           Close
0      18.823240
1      18.224106
2      17.738192
3      17.676863
4      17.577793
...          ...
6768  599.049988
6769  602.700012
6770  598.099976
6771  599.099976
6772  607.650024

[6773 rows x 1 columns]

In [5]:
import datetime

In [6]:
print(datetime.datetime.now().date())

2022-12-09

In [9]:
df.iloc[-61:]

,Date,Open,High,Low,Close,Adj Close,Volume
6712,2022-08-25,521.950012,528.299988,518.500000,520.400024,520.400024,15473450.0
6713,2022-08-26,523.799988,529.500000,522.200012,523.799988,523.799988,12855886.0
6714,2022-08-29,511.299988,517.000000,508.750000,514.849976,514.849976,9421339.0
6715,2022-08-30,518.200012,532.500000,517.950012,531.250000,531.250000,14835308.0
6716,2022-09-01,522.250000,540.900024,522.250000,533.299988,533.299988,16670228.0
...,...,...,...,...,...,...,...
6768,2022-11-17,599.099976,602.750000,596.150024,599.049988,599.049988,8167131.0
6769,2022-11-18,601.000000,605.750000,597.150024,602.700012,602.700012,12933675.0
6770,2022-11-21,602.099976,602.099976,595.349976,598.099976,598.099976,7412419.0
6771,2022-11-22,598.150024,600.700012,596.150024,599.099976,599.099976,8048595.0
6772,2022-11-23,601.549988,609.599976,601.000000,607.650024,607.650024,12435924.0